---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctSystemType
source: html/108631a7-6d3a-a5f6-cc0c-0579ca8cf999.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSystemType

An enumerated type listing all the possible duct system types for a connector object.

## Syntax (C#)
```csharp
public enum DuctSystemType
```